#include <stdio.h>
/* maximum subarray sum, divide and conquer */
पूर्णाङ्क बृहत्तमम्(पूर्णाङ्क first, पूर्णाङ्क second) { प्रत्यागम first > second ? first : second; }
पूर्णाङ्क पारगमनम्(पूर्णाङ्क मूल्यानि[], पूर्णाङ्क निम्नम्, पूर्णाङ्क मध्यम्, पूर्णाङ्क उच्चम्) {
  पूर्णाङ्क योगफलम् = 0, left = -100000, right = -100000;
  प्रति (पूर्णाङ्क index = मध्यम्; index >= निम्नम्; index--) { योगफलम् += मूल्यानि[index]; left = बृहत्तमम्(left, योगफलम्); }
  योगफलम् = 0;
  प्रति (पूर्णाङ्क index = मध्यम् + 1; index <= उच्चम्; index++) { योगफलम् += मूल्यानि[index]; right = बृहत्तमम्(right, योगफलम्); }
  प्रत्यागम left + right;
}
पूर्णाङ्क श्रेष्ठम्(पूर्णाङ्क मूल्यानि[], पूर्णाङ्क निम्नम्, पूर्णाङ्क उच्चम्) {
  यदि (निम्नम् == उच्चम्) प्रत्यागम मूल्यानि[निम्नम्];
  पूर्णाङ्क मध्यम् = (निम्नम् + उच्चम्) / 2;
  प्रत्यागम बृहत्तमम्(बृहत्तमम्(श्रेष्ठम्(मूल्यानि, निम्नम्, मध्यम्), श्रेष्ठम्(मूल्यानि, मध्यम् + 1, उच्चम्)), पारगमनम्(मूल्यानि, निम्नम्, मध्यम्, उच्चम्));
}
पूर्णाङ्क मुख्यम्(शून्य) { पूर्णाङ्क मूल्यानि[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; लिख("%d\n", श्रेष्ठम्(मूल्यानि, 0, 8)); प्रत्यागम 0; }
