// a stack class, in Java
ಸಾರ್ವಜನಿಕ ವರ್ಗ ಅಟ್ಟಿ_2 {
  ಖಾಸಗಿ ಪೂರ್ಣಾಂಕ[] ಅಂಶಗಳು = ಹೊಸ ಪೂರ್ಣಾಂಕ[16];
  ಖಾಸಗಿ ಪೂರ್ಣಾಂಕ ಮೇಲ್ಭಾಗ = 0;
  ಸಾರ್ವಜನಿಕ ಶೂನ್ಯ ತಳ್ಳು(ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯ) { ಅಂಶಗಳು[ಮೇಲ್ಭಾಗ++] = ಮೌಲ್ಯ; }
  ಸಾರ್ವಜನಿಕ ಪೂರ್ಣಾಂಕ ಎತ್ತು_2() { ಹಿಂತಿರುಗಿ ಅಂಶಗಳು[--ಮೇಲ್ಭಾಗ]; }
  ಸಾರ್ವಜನಿಕ ಸ್ಥಿರ ಶೂನ್ಯ ಮುಖ್ಯ(ಪದಪುಂಜ[] ವಾದಗಳು) {
    ಅಟ್ಟಿ_2 ಅಟ್ಟಿ = ಹೊಸ ಅಟ್ಟಿ_2();
    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯ = 1; ಮೌಲ್ಯ <= 3; ಮೌಲ್ಯ++) ಅಟ್ಟಿ.ತಳ್ಳು(ಮೌಲ್ಯ * 10);
    ವ್ಯವಸ್ಥೆ.ಹೊರಹೋಗು.ಸಾಲು_ಮುದ್ರಿಸು(ಅಟ್ಟಿ.ಎತ್ತು_2() + " " + ಅಟ್ಟಿ.ಎತ್ತು_2());
  }
}
