// a stack class, in Java
सार्वजनिक वर्ग राशिः_2 {
  गुप्त पूर्णाङ्क[] वस्तूनि = नूतन पूर्णाङ्क[16];
  गुप्त पूर्णाङ्क शिखरम् = 0;
  सार्वजनिक शून्य निक्षिप(पूर्णाङ्क मूल्यम्) { वस्तूनि[शिखरम्++] = मूल्यम्; }
  सार्वजनिक पूर्णाङ्क उद्धर() { प्रत्यागम वस्तूनि[--शिखरम्]; }
  सार्वजनिक स्थिर शून्य मुख्यम्(पदावली[] तर्काः) {
    राशिः_2 राशिः = नूतन राशिः_2();
    प्रति (पूर्णाङ्क मूल्यम् = 1; मूल्यम् <= 3; मूल्यम्++) राशिः.निक्षिप(मूल्यम् * 10);
    प्रणाली.बहिः.पङ्क्तिं_मुद्रय(राशिः.उद्धर() + " " + राशिः.उद्धर());
  }
}
