#include <stdio.h>
/* topological sort, Kahn's algorithm */
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क edges[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, indegree[6] = {0}, पङ्क्तिः[6], शिरः = 0, पुच्छम् = 0;
  प्रति (पूर्णाङ्क from = 0; from < 6; from++) प्रति (पूर्णाङ्क to = 0; to < 6; to++) indegree[to] += edges[from][to];
  प्रति (पूर्णाङ्क शीर्षम् = 0; शीर्षम् < 6; शीर्षम्++) यदि (!indegree[शीर्षम्]) पङ्क्तिः[पुच्छम्++] = शीर्षम्;
  यावत् (शिरः < पुच्छम्) {
    पूर्णाङ्क शीर्षम् = पङ्क्तिः[शिरः++];
    लिख("%d ", शीर्षम्);
    प्रति (पूर्णाङ्क to = 0; to < 6; to++) यदि (edges[शीर्षम्][to] && --indegree[to] == 0) पङ्क्तिः[पुच्छम्++] = to;
  }
  लिख("\n");
  प्रत्यागम 0;
}
