#include <stdio.h>
/* N queens: count the solutions for N = 6 */
पूर्णाङ्क स्तम्भः[8], size = 6, समाधानानि = 0;
पूर्णाङ्क सुरक्षित(पूर्णाङ्क पङ्क्तिका, पूर्णाङ्क स्तम्भः_2) {
  प्रति (पूर्णाङ्क prior = 0; prior < पङ्क्तिका; prior++)
    यदि (स्तम्भः[prior] == स्तम्भः_2 || स्तम्भः[prior] - स्तम्भः_2 == prior - पङ्क्तिका || स्तम्भः_2 - स्तम्भः[prior] == prior - पङ्क्तिका) प्रत्यागम 0;
  प्रत्यागम 1;
}
शून्य स्थापय(पूर्णाङ्क पङ्क्तिका) {
  यदि (पङ्क्तिका == size) { समाधानानि++; प्रत्यागम; }
  प्रति (पूर्णाङ्क स्तम्भः_2 = 0; स्तम्भः_2 < size; स्तम्भः_2++) यदि (सुरक्षित(पङ्क्तिका, स्तम्भः_2)) { स्तम्भः[पङ्क्तिका] = स्तम्भः_2; स्थापय(पङ्क्तिका + 1); }
}
पूर्णाङ्क मुख्यम्(शून्य) { स्थापय(0); लिख("%d\n", समाधानानि); प्रत्यागम 0; }
